SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_adc.c
/*****************************************************************************
 * Copyright (c) 2019, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/

/**
*\*\file n32g430_adc.c
*\*\author Nations
*\*\version v1.0.1
*\*\copyright Copyright (c) 2019, Nations Technologies Inc. All rights reserved.
**/

#include "n32g430_adc.h"
#include "n32g430_rcc.h"

/** ADC Private Defines**/

/** API interface function definition**/
uint32_t vrefint_value; 

CMD_RETURN_CR (*Program_NVR)(uint32_t addr, uint32_t  data) = (CMD_RETURN_CR (*)(uint32_t ,uint32_t ))0x1FFF01D1;
CMD_RETURN_CR     (*Get_NVR)(uint32_t addr, uint32_t* data) = (CMD_RETURN_CR (*)(uint32_t ,uint32_t*))0x1FFF02A5;

/**
*\*\name    ADC_Vrefint_Get.
*\*\fun     Return the Vrefint value of NVR.
*\*\return  vrefint_value
**/
uint32_t ADC_Vrefint_Get(void)
{
		Get_NVR(0x1FFFF268, &vrefint_value);
		return vrefint_value;
}

/** ADC Driving Functions Declaration**/

/**
*\*\name    ADC_Reset.
*\*\fun     Reset the ADC registers.
*\*\return  none
**/
void ADC_Reset(void)
{
    RCC_AHB_Peripheral_Reset(RCC_AHB_PERIPH_ADC);
}

/**
*\*\name    ADC_Multichannels_Enable.
*\*\fun     Configures the ADC according conversion is performed in
*\*\        Scan (multichannels) mode.
*\*\return  none
**/
void ADC_Multichannels_Enable(void)
{
    /* Set ADC_CTRL1 SCANMD bit */
    ADC->CTRL1 |= ADC_MULTCH_ENABLE;
}

/**
*\*\name    ADC_Multichannels_Disable.
*\*\fun     Configures the ADC according conversion is performed in
*\*\        Single (one channel) mode.
*\*\return  none
**/
void ADC_Multichannels_Disable(void)
{
    /* Clear ADC_CTRL1 SCANMD bit */
    ADC->CTRL1 &= ADC_MULTCH_DISABLE;
}

/**
*\*\name    ADC_Continue_Conversion_Enable.
*\*\fun     Configures the ADC according conversion is performed in
*\*\        Continuous mode.
*\*\return  none
**/
void ADC_Continue_Conversion_Enable(void)
{
    /* Set ADC_CTRL2 CTU bit */
    ADC->CTRL2 |= ADC_CTU_ENABLE;
}

/**
*\*\name    ADC_Continue_Conversion_Disable.
*\*\fun     Configures the ADC according conversion is performed in
*\*\        Single mode.
*\*\return  none
**/
void ADC_Continue_Conversion_Disable(void)
{
    /* Clear ADC_CTRL2 CTU bit */
    ADC->CTRL2 &= ADC_CTU_DISABLE;
}

/**
*\*\name    ADC_Regular_Group_External_Trigger_Source_Config.
*\*\fun     Configures the ADC external trigger source for regular group channels.
*\*\param   external_trigger_sources :
*\*\          - ADC_EXT_TRIGCONV_REGULAR_T1_CC1                
*\*\          - ADC_EXT_TRIGCONV_REGULAR_T1_CC2                
*\*\          - ADC_EXT_TRIGCONV_REGULAR_T1_CC3                
*\*\          - ADC_EXT_TRIGCONV_REGULAR_T2_CC2                
*\*\          - ADC_EXT_TRIGCONV_REGULAR_T3_TRGO               
*\*\          - ADC_EXT_TRIGCONV_REGULAR_T4_CC4                
*\*\          - ADC_EXT_TRIGCONV_REGULAR_EXT_INT11_TIM8_TRGO   
*\*\          - ADC_EXT_TRIGCONV_REGULAR_SWSTRRCH              
*\*\return  none
**/
void ADC_Regular_Group_External_Trigger_Source_Config(uint32_t external_trigger_sources)
{
    /* Clear ADC_CTRL2 EXTRSEL[2:0] bit */
    ADC->CTRL2 &= ADC_EXT_TRIGCONV_REGULAR_MASK;
    /* Set ADC_CTRL2 EXTJSEL[2:0] bit */
    ADC->CTRL2 |= external_trigger_sources;
}

/**
*\*\name    ADC_Data_Alignment_Config.
*\*\fun     Configures the ADC data alignment is left or right.
*\*\param   data_alignment :
*\*\          - ADC_DAT_ALIGN_R
*\*\          - ADC_DAT_ALIGN_L
*\*\return  none
**/
void ADC_Data_Alignment_Config(uint32_t data_alignment)
{
    /* Clear ADC_CTRL2 ALIG bit */
    ADC->CTRL2 &= ADC_ALIG_MASK;
    /* Set ADC_CTRL2 ALIG bit */
    ADC->CTRL2 |= data_alignment;
}

/**
*\*\name    ADC_Regular_Channels_Number_Config.
*\*\fun     Configures the ADC total number of conversion channels.
*\*\param   channels_number :
*\*\          - ADC_REGULAR_LEN_1
*\*\          - ADC_REGULAR_LEN_2
*\*\          - ADC_REGULAR_LEN_3
*\*\          - ADC_REGULAR_LEN_4
*\*\          - ADC_REGULAR_LEN_5
*\*\          - ADC_REGULAR_LEN_6
*\*\          - ADC_REGULAR_LEN_7
*\*\          - ADC_REGULAR_LEN_8
*\*\          - ADC_REGULAR_LEN_9
*\*\          - ADC_REGULAR_LEN_10
*\*\          - ADC_REGULAR_LEN_11
*\*\          - ADC_REGULAR_LEN_12
*\*\          - ADC_REGULAR_LEN_13
*\*\          - ADC_REGULAR_LEN_14
*\*\          - ADC_REGULAR_LEN_15
*\*\          - ADC_REGULAR_LEN_16
*\*\return  none
**/
void ADC_Regular_Channels_Number_Config(uint32_t channels_number)
{
    /* Clear ADC_RSEQ1 LEN[3:0] bit */
    ADC->RSEQ1 &= ADC_REGULAR_LEN_MSAK;
    /* Set ADC_RSEQ1 LEN[3:0] bit */
    ADC->RSEQ1 |= channels_number;
}

/**
*\*\name    ADC_Initializes.
*\*\fun     Initializes the ADC according to ADC_initstruct.
*\*\param   ADC_initstruct :
*\*\          - MultiChEn
*\*\            - DISABLE
*\*\            - ENABLE
*\*\          - ContinueConvEn
*\*\            - DISABLE
*\*\            - ENABLE
*\*\          - ExtTrigSelect
*\*\            - ADC_EXT_TRIGCONV_REGULAR_T1_CC1                
*\*\            - ADC_EXT_TRIGCONV_REGULAR_T1_CC2                
*\*\            - ADC_EXT_TRIGCONV_REGULAR_T1_CC3                
*\*\            - ADC_EXT_TRIGCONV_REGULAR_T2_CC2                
*\*\            - ADC_EXT_TRIGCONV_REGULAR_T3_TRGO               
*\*\            - ADC_EXT_TRIGCONV_REGULAR_T4_CC4                
*\*\            - ADC_EXT_TRIGCONV_REGULAR_EXT_INT11_TIM8_TRGO   
*\*\            - ADC_EXT_TRIGCONV_REGULAR_SWSTRRCH              
*\*\          - DatAlign
*\*\            - ADC_DAT_ALIGN_R
*\*\            - ADC_DAT_ALIGN_L
*\*\          - ChsNumber
*\*\            - ADC_REGULAR_LEN_1
*\*\            - ADC_REGULAR_LEN_2
*\*\            - ADC_REGULAR_LEN_3
*\*\            - ADC_REGULAR_LEN_4
*\*\            - ADC_REGULAR_LEN_5
*\*\            - ADC_REGULAR_LEN_6
*\*\            - ADC_REGULAR_LEN_7
*\*\            - ADC_REGULAR_LEN_8
*\*\            - ADC_REGULAR_LEN_9
*\*\            - ADC_REGULAR_LEN_10
*\*\            - ADC_REGULAR_LEN_11
*\*\            - ADC_REGULAR_LEN_12
*\*\            - ADC_REGULAR_LEN_13
*\*\            - ADC_REGULAR_LEN_14
*\*\            - ADC_REGULAR_LEN_15
*\*\            - ADC_REGULAR_LEN_16
*\*\return  none
**/
void ADC_Initializes(ADC_InitType* ADC_initstruct)
{
    if(ADC_initstruct->MultiChEn)
    {
        ADC_Multichannels_Enable();
    }
    else
    {
        ADC_Multichannels_Disable();
    }

